Revit 2027 API
ViewCropRegionShapeManager.RemoveCropRegionShape Method
 Removes any non-rectangular boundary of the view's crop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveCropRegionShape()
Public Sub RemoveCropRegionShape
public:
void RemoveCropRegionShape()
member RemoveCropRegionShape : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The crop of the associated view is not permitted to have a non-rectangular shape.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace